In [2]:
import pandas as pd
penguins_adelie = pd.read_csv("penguins_adelie.csv")
penguins_chinstrap = pd.read_csv("penguins_chinstrap.csv")
penguins_gentoo = pd.read_csv("penguins_gentoo.csv")

In [5]:
penguins_all = pd.concat([penguins_adelie,penguins_chinstrap,penguins_gentoo])
penguins_all.shape[0]

344

In [18]:
penguins_all.head(2)

,studyName,Sample Number,Species,Region,Island,Stage,Individual ID,Clutch Completion,Date Egg,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex,Delta 15 N (o/oo),Delta 13 C (o/oo),Comments
0,PAL0708,1,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A1,Yes,2007-11-11,39.1,18.7,181.0,3750.0,MALE,NaN,NaN,Not enough blood for isotopes.
1,PAL0708,2,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A2,Yes,2007-11-11,39.5,17.4,186.0,3800.0,FEMALE,8.94956,-24.69454,NaN

In [15]:
island_data = {
    'Island': ['Torgersen', 'Biscoe', 'Dream'],
    'Latitude': [-64.7667, -66.0000, -64.7333],
    'Longitude': [-64.0667, -66.0000, -64.2333],
    'Location': [
        'Torgersen Island, near Palmer Station on the Antarctic Peninsula, close to Anvers Island',
        'Biscoe Islands, an archipelago off the west coast of the Antarctic Peninsula, south of the Palmer Archipelago',
        'Dream Island, part of the Argentine Islands, located near the western side of the Antarctic Peninsula'
    ]
} 
penguin_islands_df = pd.DataFrame(island_data)
penguin_islands_df.head(2)

,Island,Latitude,Longitude,Location
0,Torgersen,-64.7667,-64.0667,"Torgersen Island, near Palmer Station on the A..."
1,Biscoe,-66.0000,-66.0000,"Biscoe Islands, an archipelago off the west co..."

In [19]:
penguins_all_merged = pd.merge(penguins_all,penguin_islands_df, on='Island') 
penguins_all_merged.describe()

,Sample Number,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Delta 15 N (o/oo),Delta 13 C (o/oo),Latitude,Longitude
count,344.000000,342.000000,342.000000,342.000000,342.000000,330.000000,331.000000,344.000000,344.000000
mean,63.151163,43.921930,17.151170,200.915205,4201.754386,8.733382,-25.686292,-65.356970,-65.070923
std,40.430199,5.459584,1.974793,14.061714,801.954536,0.551770,0.793961,0.629256,0.910667
min,1.000000,32.100000,13.100000,172.000000,2700.000000,7.632200,-27.018540,-66.000000,-66.000000
25%,29.000000,39.225000,15.600000,190.000000,3550.000000,8.299890,-26.320305,-66.000000,-66.000000
50%,58.000000,44.450000,17.300000,197.000000,4050.000000,8.652405,-25.833520,-64.766700,-64.233300
75%,95.250000,48.500000,18.700000,213.000000,4750.000000,9.172123,-25.062050,-64.733300,-64.233300
max,152.000000,59.600000,21.500000,231.000000,6300.000000,10.025440,-23.787670,-64.733300,-64.066700

In [29]:
url = "https://raw.githubusercontent.com/allisonhorst/palmerpenguins/master/inst/extdata/penguins.csv"
penguins = pd.read_csv(url)
penguins_isna = penguins.isna()
penguins_isna.groupby('year').sum()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
year,,,,,,,
False,0,0,2,2,2,2,11

In [31]:
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [33]:
penguins.groupby('species')['body_mass_g'].mean()

species
Adelie       3700.662252
Chinstrap    3733.088235
Gentoo       5076.016260
Name: body_mass_g, dtype: float64

In [35]:
penguins.groupby('species')['body_mass_g'].max().sort_values(ascending=False)

species
Gentoo       6300.0
Chinstrap    4800.0
Adelie       4775.0
Name: body_mass_g, dtype: float64

In [39]:
penguins.groupby(['species','sex']).size().sort_values(ascending=False)

species    sex
Adelie     female    73
           male      73
Gentoo     male      61
           female    58
Chinstrap  male      34
           female    34
dtype: int64

In [48]:
penguins_min_flipper = penguins.groupby(['species'])['flipper_length_mm'].min()
penguins_max_flipper = penguins.groupby(['species'])['flipper_length_mm'].max()
penguins_flippe = pd.merge(penguins_min_flipper,penguins_max_flipper, on='species') 
penguins_flippe['diff'] = penguins_flippe['flipper_length_mm_y']-penguins_flippe['flipper_length_mm_x']
penguins_flippe

           flipper_length_mm_x  flipper_length_mm_y  diff
species
Adelie                   172.0                210.0  38.0
Chinstrap                178.0                212.0  34.0
Gentoo                   203.0                231.0  28.0

In [ ]:
penguins.groupby('island')['body_mass_g'].median().sort_values(ascending=False)

island
Biscoe       4775.0
Torgersen    3700.0
Dream        3687.5
Name: body_mass_g, dtype: float64

In [55]:
penguins.groupby('species')['flipper_length_mm'].mean().sort_values(ascending=False)

species
Gentoo       217.186992
Chinstrap    195.823529
Adelie       189.953642
Name: flipper_length_mm, dtype: float64